tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'jjuarez/tap-1'

# Binaries
brew 'awk'
brew 'bash'
brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'curl'
brew 'cmake'
brew 'croc'
brew 'certbot'
brew 'findutils'
brew 'git'
brew 'git-crypt'
brew 'grep'
brew 'gnu-sed'
brew 'helm'
brew 'iproute2mac'
brew 'istioctl'
brew 'kubectl'
brew 'kubecolor'
brew 'kubectx'
brew 'jq'
brew 'nmap'
brew 'openssh'
brew 'openssl'
brew 'pass'
brew 'pwgen'
brew 'ssh-copy-id'
brew 'sshuttle'
brew 'stern'
brew 'tcptraceroute'
brew 'tfenv'
brew 'unar'
brew 'tldr'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'bitwarden'
cask 'firefox-developer-edition', language: 'en-GB'
cask 'font-fira-code'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'numi'
cask 'visual-studio-code'
