# Add tap
tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'dty1er/tap'

# Binaries
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'curl'
brew 'cmake'
brew 'findutils'
brew 'git'
brew 'grep'
brew 'helm'
brew 'iproute2mac'
brew 'kubectl'
brew 'kubecolor'
brew 'jq'
brew 'nmap'
brew 'mas'
brew 'openssh'
brew 'pwgen'
brew 'ssh-copy-id'
brew 'tcptraceroute'
brew 'unar'
brew 'tldr'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'adoptopenjdk13'
cask 'bitwarden'
cask 'firefox-developer-edition', language: 'en-GB'
cask 'font-fira-code'
cask 'iterm2'
cask 'numi'
cask 'visual-studio-code'

# mas 'Amphetamine', id: 937984704
