# Add tap
tap 'AdoptOpenJDK/openjdk'
tap 'dart-lang/dart'
tap 'homebrew/cask-fonts'
tap 'dty1er/tap'

# Binaries
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'curl'
brew 'cmake'
brew 'dart'
brew 'dnsmasq'
brew 'findutils'
brew 'git'
brew 'grep'
brew 'helm'
brew 'iproute2mac'
brew 'kubectl'
brew 'kubecolor'
brew 'jq'
brew 'node@14'
brew 'nmap'
brew 'openssh'
brew 'pwgen'
brew 'ssh-copy-id'
brew 'tcptraceroute'
brew 'socat'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'

brew 'zsh'
brew 'zsh-syntax-highlighting'

# Java versions
cask 'adoptopenjdk13'
cask 'font-fira-code'
